# 한영변환 안돼서 영어로 써진 문자열을 한글로 바꿔주는 프로그램
dict = {
'a':'ㅁ',
'b':'ㅠ',
'c':'ㅊ',
'd':'ㅇ',
'e':'ㄷ',
'E':'ㄸ',
'f':'ㄹ',
'g':'ㅎ',
'h':'ㅗ',
'i':'ㅑ',
'j':'ㅓ',
'k':'ㅏ',
'l':'ㅣ',
'm':'ㅡ',
'n':'ㅜ',
'o':'ㅐ',
'O':'ㅒ',
'p':'ㅔ',
'P':'ㅖ',
'q':'ㅂ',
'Q':'ㅃ',
'r':'ㄱ',
'R':'ㄲ',
's':'ㄴ',
't':'ㅅ',
'T':'ㅆ',
'u':'ㅕ',
'v':'ㅍ',
'w':'ㅈ',
'W':'ㅉ',
'x':'ㅌ',
'y':'ㅛ',
'z':'ㅋ'
}
jamo = {
'ㄱ':1,
'ㄴ':1,
'ㄷ':1,
'ㄹ':1,
'ㅁ':1,
'ㅂ':1,
'ㅅ':1,
'ㅇ':1,
'ㅈ':1,
'ㅊ':1,
'ㅋ':1,
'ㅌ':1,
'ㅍ':1,
'ㅎ':1,
'ㅏ':2,
'ㅑ':2,
'ㅓ':2,
'ㅕ':2,
'ㅗ':2,
'ㅛ':2,
'ㅜ':2,
'ㅠ':2,
'ㅡ':2,
'ㅣ':2,
'ㅐ':2,
'ㅔ':2,
'ㅒ':2,
'ㅖ':2
}

str = 'dkssudgktpdy'

h_str=""
for x in str:
    h_str+=dict[x]

print(h_str)

length = len(h_str)
result=[]

# 규칙: 모음 앞에 있는 자음은 무조건 그 모음이 속한 글자의 초성.
for i in range(length):
    if jamo[h_str[i]]==2:
        result.append(h_str[i-1:i+1])
        # 모음 앞에 자음-자음이면 첫번째 자음은 이전 글자의 종성.
        if i>3 and jamo[h_str[i-2]]==1:
            result[-2] = h_str[i-4:i-1]

print(result)
